run/NACA0012/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0); 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
		type            inletOutlet;
		inletValue	 	uniform (0 0 0);
		value		 	uniform (0 0 0);
    }
    sides
    {
        type            slip;
    }	    
    foil
    {
        type            noSlip;
    }	
    frontAndBack
    {
		type			empty;
    }

}

// ************************************************************************* //
